/**
  ******************************************************************************
  * @file          debug_log.h
  * @brief         debug log
  * @author        Egahp
  * @email         2687434412@qq.com
  * @version       1.0
  * @date          2021.07.06
  ******************************************************************************
  * @attention
  * 
  * <h2><center>&copy; Copyright 2020 Egahp.
  * All rights reserved.</center></h2>
  * 
  * @htmlonly 
  * <span style='font-weight: bold'>修订历史</span> 
  * @endhtmlonly
  * 版本|作者|时间|描述
  * ----|----|----|----
  * 1.0|Egahp|2021.07.06|创建文件
  ******************************************************************************
  */


/* 包含文件 ------------------------------------------------------------------*/
#include "debug_log.h"
/* 宏定义 --------------------------------------------------------------------*/

/* 类型定义 ------------------------------------------------------------------*/

/* 函数声明 ------------------------------------------------------------------*/

/* 变量定义 ------------------------------------------------------------------*/

/* 函数原型 ------------------------------------------------------------------*/

__attribute__((weak)) void assert_handler(const char *x_string,const char *file,uint32_t line){
    volatile uint8_t dummy = 0;
    LOG_ERROR("assertion failed [ %s ] at line number [ %d ], file [ %s ] \n",x_string,line,file);
    while(dummy == 0);
}

void debug_log_init(void){
    SEGGER_RTT_Init();
}

/************************ (C) COPYRIGHT 2020 Egahp *****END OF FILE*************/
